[{
    "year": "2024-2025",
    "event_name": "Click.Drag.Create Workshop",
    "event_card_description": "The \"Click.Drag.Create\" workshop, held on September 13th at KJ Somaiya School of Engineering, provided students with a hands-on introduction to UI/UX design using Figma. Led by Mr. Sooraj Nair and Mr. Rishabh Singh from the Friends of Figma community, the workshop focused on teaching Figma's interface, tools, and practical applications. Participants learned how to design UI elements like shapes, buttons, and icons, and applied their skills by creating a Spotify clone, which helped them understand Figma's real-world use in web design. The workshop fostered an interactive learning environment, with Mr. Nair leading the discussions and Mr. Singh providing personalized guidance. The session ended with an engaging quiz to test participant's understanding, followed by a Q&A that allowed them to clarify doubts and exchange insights with peers. Organized by ISTE KJSSE, the workshop empowered students with the skills and confidence to use Figma in their projects, promoting creativity and collaboration in design.",
    "event_date": "13/09/2024",
    "event_pic": "workshop_click.drag.create_2024-2025.jpeg",
    "event_markdown": "## Click.Drag.Create Workshop\n\nThe \"Click.Drag.Create\" workshop was held on September 13th at KJ Somaiya School of Engineering, offering students a hands-on introduction to UI/UX design using Figma.\n\nLed by Mr. Sooraj Nair and Mr. Rishabh Singh from the Friends of Figma community, the session covered Figma's interface, tools, and practical applications. Participants designed UI elements such as shapes, buttons, and icons, and created a Spotify clone to understand Figma's real-world implementation in web design.\n\nThe workshop encouraged interactive learning, with discussions led by Mr. Nair and personalized guidance provided by Mr. Singh. The session concluded with an engaging quiz and a Q&A round, allowing students to clarify doubts and exchange insights.\n\nOrganized by ISTE KJSSE, the workshop empowered students with practical design skills, fostering creativity and collaboration in UI/UX development.",
    "event_url": "https://raw.githubusercontent.com/KJSCE-ISTE/Web-Assets-1/refs/heads/main/events/2024-2025/workshop_click.drag.create_2024-2025.jpeg"
  },
  {
    "year": "2024-2025",
    "event_name": "TechTangle ",
    "event_card_description": "The TechTangle Challenge, organized by ISTE KJSSE as part of Abhiyantriki 2024 at K J Somaiya School of Engineering, was a dynamic and intellectually stimulating hybrid competition that tested participant's skills in coding, debugging, and hardware. Featuring four unique task zones, the event provided an engaging platform for students to apply their technical knowledge in a competitive yet collaborative environment.",
    "event_date": "14/10/2024",
    "event_pic": "abhiyantriki_techtangle_2024-2025.jpeg",
    "event_markdown": "## TechTangle Challenge\n\nThe TechTangle Challenge, organized by ISTE KJSSE at K J Somaiya School of Engineering as part of Abhiyantriki 2024, was a hybrid technical competition designed to evaluate proficiency in both software and hardware domains.\n\nThe event featured four task zones:\n\n- **Word-up:** A themed crossword followed by writing code or pseudo-code using the discovered words.\n- **DevZone:** A Jenga-inspired coding round involving CSS snippets and output-based tasks.\n- **Fixit:** A debugging challenge requiring participants to correct faulty code to match expected outputs.\n- **Hardware Challenge:** Assembling a functional circuit using components such as Arduino, I2C LCD, IR sensors, and LEDs.\n\nOpen to intercollegiate participation, students competed individually or in teams of two. Judging criteria included accuracy, time efficiency, and number of hints used. A registration fee of ₹50 per individual and ₹80 per duo team was charged, with prizes worth ₹5,000 awarded to top performers.\n\nWith proper resources provided and a distinguished KJSSE alumnus interacting with participants, the event successfully fostered practical learning, real-time debugging skills, and innovation among future technocrats.",
    "event_url": "https://raw.githubusercontent.com/KJSCE-ISTE/Web-Assets-1/refs/heads/main/events/2024-2025/abhiyantriki_techtangle_2024-2025.jpeg"
  },
  {
    "year": "2024-2025",
    "event_name": "ThinkSprint",
    "event_card_description": "ThinkSprint, organized by ISTE KJSSE, was an intellectually stimulating and fast-paced case study competition designed to test participant's critical thinking, creativity, and collaborative problem-solving skills. Simulating real-world business and technological environments, the event challenged teams to analyze complex scenarios, develop innovative yet feasible solutions, and present their ideas under structured time constraints. Through its two-phase format and expert evaluation, ThinkSprint fostered analytical reasoning, interdisciplinary application, and boardroom-level decision-making skills among students.",
    "event_date": "24/03/2025",
    "event_pic": "case study competition_thinksprint_2024-2025.jpeg",
    "event_markdown": "## ThinkSprint\n\nThinkSprint, organized by ISTE KJSSE, was a dynamic case study competition aimed at enhancing critical thinking, creativity, and collaborative problem-solving skills. The event simulated real-world business and technological challenges, encouraging rapid analysis and structured reasoning.\n\nParticipants formed teams and tackled complex scenarios across domains such as technology, entrepreneurship, societal challenges, and business strategy. The competition was conducted in two phases. In the first round, teams submitted a proposal outlining their approach, judged on originality, clarity, and potential impact. Shortlisted teams advanced to the final round to present their refined ideas before a panel of expert judges.\n\nThe final round was evaluated based on innovation, feasibility, depth of understanding, practicality, and presentation skills. It was judged by Mr. Rajvardhan Patil, an alumnus of KJSSE, who provided valuable industry-oriented feedback and insights.\n\nRegistration was free to ensure inclusivity, and winning teams were awarded certificates and cash prizes up to Rs. 10,000. The event successfully promoted analytical thinking, leadership, adaptability, and innovation among participants.",
    "event_url": "https://raw.githubusercontent.com/KJSCE-ISTE/Web-Assets-1/refs/heads/main/events/2024-2025/case%20study%20competition_thinksprint_2024-2025.jpeg"
  },
  {
    "year": "2024-2025",
    "event_name": "Prakalpa 2025",
    "event_card_description": "Prakalpa 2025, the National Level flagship event organized by ISTE KJSSE on April 9, 2025, at K J Somaiya School of Engineering, provided a prestigious platform for engineering students to showcase innovative working models and research through project demonstrations and paper presentations. Featuring participation from institutions across India, including SVU and its first international participant, the event promoted technical excellence, interdisciplinary collaboration, and industry-oriented innovation across domains such as AI, ML, IoT, Robotics, Cybersecurity, and Autonomous Systems.",
    "event_date": "09/04/2025",
    "event_pic": "prakalpa_technovate_2024-2025.jpeg",
    "event_markdown": "## Prakalpa 2025\n\nThe Indian Society for Technical Education (ISTE KJSSE) successfully organized its National Level flagship event, **Prakalpa 2025**, on April 9, 2025, at K J Somaiya School of Engineering. The event featured a Research Paper Presentation and a Working Model Project Competition, providing students a national platform to showcase innovative hardware and software solutions while promoting creativity, research, and technological advancement.\n\nA total of **58 teams** participated, including **39 Working Model projects** (22 hardware and 17 software) and **19 Research Paper presentations**. Participants represented SVU and various institutions across India, with the event marking a milestone by hosting its first international participant.\n\nThe event commenced with a traditional lamp-lighting ceremony graced by Director Dr. S. K. Ukarande, Deputy Director Dr. Deepak Sharma, Faculty Advisors Dr. Sushma Kadge and Prof. Abhishek Bhadauria, along with the panel of judges. Dr. Ukarande delivered the inaugural address emphasizing student-led innovation, followed by encouraging messages from Dr. Sharma and Dr. Kadge.\n\nProjects were evaluated by a distinguished panel of judges on parameters such as innovation, feasibility, and impact. Themes included Artificial Intelligence, Machine Learning, IoT, Cybersecurity, Game Development, Robotics, and Autonomous Systems.\n\nStandout projects included *FireWatch 700: IoT-Based Firefighting Bot*, *Portable Vehicular Emission Detector with Location Tracker*, *Parity Protocol: a Decentralized Compute Network*, and *ColorViTAN: a Vision Transformer-based greyscale image colorization model*.\n\nParticipants engaged in insightful discussions with judges and received constructive feedback. All teams were awarded certificates, while winners received cash prizes and goodies. The event also featured a visit from a KJSSE alumnus who inspired participants with professional insights.\n\nPrakalpa 2025 concluded successfully, reaffirming ISTE KJSSE's commitment to fostering innovation, interdisciplinary collaboration, and practical problem-solving among future engineers.",
    "event_url": "https://raw.githubusercontent.com/KJSCE-ISTE/Web-Assets-1/refs/heads/main/events/2024-2025/prakalpa_technovate_2024-2025.jpeg"
    
  }
  

]