[{
    "year": "2023-2024",
    "event_name": "GeekSpeak",
    "event_card_description": "GeekSpeak was an enriching seminar led by Mr. Jay Malave, focusing on programming, Google Developer Student Clubs (GDSC), and hackathons. The event attracted students eager to enhance their technical skills and explore new opportunities within the tech community. Mr. Malave, an accomplished programmer and former GDSC lead, brought a wealth of knowledge and experience to the session. Throughout the seminar, Jay shared invaluable insights from his personal journey in the tech world. He discussed various programming techniques, emphasizing the importance of continuous learning and practice. His detailed explanation of Google Developer Student Clubs highlighted the benefits of joining such communities, including access to resources, mentorship, and collaboration opportunities. A significant portion of the seminar was dedicated to hackathons. Jay provided strategies for success in these competitive events, drawing from his own experiences. He covered essential aspects such as team formation, idea generation, effective time management, and presenting projects to judges. The seminar concluded with an interactive Q&A session, where attendees had the chance to ask questions and engage directly with Jay. This segment fostered a deeper understanding of the topics discussed and encouraged collaboration and networking among participants. Overall, GeekSpeak was a highly informative and motivational event, promoting learning, innovation, and community within the tech space.",
    "event_date": "2023",
    "event_pic": "seminar_geekspeak_2023-2024.jpg",
    "event_markdown": "## GeekSpeak\n\nGeekSpeak was an enriching seminar led by Mr. Jay Malave, focusing on programming, Google Developer Student Clubs (GDSC), and hackathons. The event attracted students eager to enhance their technical skills and explore new opportunities within the tech community.\n\nMr. Malave, an accomplished programmer and former GDSC lead, shared invaluable insights from his personal journey in the tech world. He discussed various programming techniques, emphasized continuous learning and practice, and explained the benefits of joining Google Developer Student Clubs, including access to resources, mentorship, and collaboration opportunities.\n\nA significant portion of the seminar was dedicated to hackathons, where he provided strategies for success, covering team formation, idea generation, time management, and project presentation. The seminar concluded with an interactive Q&A session that encouraged collaboration and networking among participants.\n\nOverall, GeekSpeak was a highly informative and motivational event, promoting learning, innovation, and community within the tech space.",
    "event_url": "https://raw.githubusercontent.com/KJSCE-ISTE/Web-Assets-1/refs/heads/main/events/2023-2024/seminar_geekspeak_2023-2024.png"
  },
  {
    "year": "2022-2023",
    "event_name": "CreAIte AI Workshop",
    "event_card_description": "The CreAIte AI Workshop, hosted by Abhinav Gupta, founder of 100xengineers, attracted a diverse audience of college-level AI enthusiasts eager to delve into the fascinating world of artificial intelligence. The workshop was meticulously designed to cover a range of practical AI applications, making it highly relevant for the attendees. It commenced with an in-depth session on effectively using ChatGPT, providing participants with valuable insights into leveraging this tool for various applications. This session highlighted the potential of AI in creating compelling graphics that can captivate audiences and improve engagement. Next, the focus shifted to the Tome.ai presentation tool, which simplifies the process of creating professional presentations using AI, making it an indispensable resource for students and professionals alike. One of the most intriguing parts of the workshop was the demonstration of voice transformation using rvc.ai. This technology allows for realistic voice modifications, showcasing the versatility and potential of AI in audio applications. Throughout the workshop, Mr. Abhinav Gupta's engaging presentation style made complex AI concepts accessible to all participants, regardless of their prior experience with AI. The event concluded on a high note, with participants leaving with a wealth of practical knowledge and inspiration. They were equipped with new skills and ideas on how to incorporate AI into their projects, whether academic or professional. The CreAIte AI Workshop not only provided valuable technical knowledge but also ignited a passion for AI, encouraging participants to explore and innovate further in this exciting field.",
    "event_date": "2023",
    "event_pic": "workshop_creaite_2023-2024.jpg",
    "event_markdown": "## CreAIte AI Workshop\n\nThe CreAIte AI Workshop, hosted by Abhinav Gupta, founder of 100xengineers, attracted a diverse audience of college-level AI enthusiasts eager to delve into the fascinating world of artificial intelligence. The workshop was meticulously designed to cover a range of practical AI applications, making it highly relevant for the attendees. It commenced with an in-depth session on effectively using ChatGPT, providing participants with valuable insights into leveraging this tool for various applications. This session highlighted the potential of AI in creating compelling graphics that can captivate audiences and improve engagement. Next, the focus shifted to the Tome.ai presentation tool, which simplifies the process of creating professional presentations using AI, making it an indispensable resource for students and professionals alike. One of the most intriguing parts of the workshop was the demonstration of voice transformation using rvc.ai. This technology allows for realistic voice modifications, showcasing the versatility and potential of AI in audio applications. Throughout the workshop, Mr. Abhinav Gupta's engaging presentation style made complex AI concepts accessible to all participants, regardless of their prior experience with AI. The event concluded on a high note, with participants leaving with a wealth of practical knowledge and inspiration. They were equipped with new skills and ideas on how to incorporate AI into their projects, whether academic or professional. The CreAIte AI Workshop not only provided valuable technical knowledge but also ignited a passion for AI, encouraging participants to explore and innovate further in this exciting field.",
    "event_url": "https://raw.githubusercontent.com/KJSCE-ISTE/Web-Assets-1/refs/heads/main/events/2023-2024/workshop_creaite_2023-2024.jpg"
  

  },
  {
    "year": "2023-2024",
    "event_name": "Prakalpa 2024",
    "event_card_description": "ISTE-KJSCE organized Prakalpa 2024 on April 3, 2024, a prestigious national-level event held at KJ Somaiya College of Engineering, providing a platform for research paper presentations and Working Model Projects.",
    "event_date": "03/04/2024",
    "event_pic": "prakalpa_techxpo_2023-2024.jpg",
    "event_markdown": "## Prakalpa 2024\n\nISTE-KJSCE organized Prakalpa on April 3, 2024, a prestigious national-level event held at KJ Somaiya College of Engineering. This event was a significant platform for budding engineers and innovators to showcase their research and technical skills through research paper presentations and Working Model Projects.\n\nThe event attracted a diverse group of participants, highlighting the widespread appeal and recognition of Prakalpa in the engineering community. The research paper presentation segment featured 26 groups who meticulously presented their findings and innovations to a panel of esteemed judges. These judges, with their extensive expertise and experience, evaluated the presentations based on various criteria including originality, technical depth, clarity of presentation, and the potential impact of the research. This provided a valuable opportunity for participants to gain feedback and insights from experts, helping them refine their research further.\n\nIn the Working Model Project Competition, 32 groups showcased their innovative projects, demonstrating practical applications of engineering principles and creative problem-solving. Noteworthy projects included VanyaRakshak; a Wireless EV Charging System that promises to revolutionize electric vehicle infrastructure; a Leaf Detection System for agricultural advancements; the Ultra Vision Stick; a Parabolic Trough Collector & many more.\n\nThe event culminated in a grand ceremony where certificates ,hampers and cash prizes upto Rs 50,000/- were awarded to the winners.",
    "event_url": "https://raw.githubusercontent.com/KJSCE-ISTE/Web-Assets-1/refs/heads/main/events/2023-2024/prakalpa_techxpo_2023-2024.jpg"
  }
  
]